In [1]:
import numpy as np
import pandas as pd

In [2]:
date = pd.read_excel('orders.xlsx')
time = pd.read_excel('messages.xlsx')
date.head()

        date  product_id  city_id  orders
0 2019-12-10        5628       25       3
1 2018-08-15        3646       14     157
2 2018-10-23        1859       25       1
3 2019-08-17        7292       25       1
4 2019-01-06        4344       25       3

In [3]:
date = date.drop(columns=['product_id','city_id','orders']).head()

In [4]:
time.head()

                 date                                                msg
0 2013-12-15 00:50:00                           ищу на сегодня мужика 37
1 2014-04-29 23:40:00   ПАРЕНЬ БИ ИЩЕТ ДРУГА СЕЙЧАС!! СМС ММС 0955532826
2 2012-12-30 00:21:00           Днепр.м 43 позн.с д/ж *.о  067.16.34.576
3 2014-11-28 00:31:00  КИЕВ ИЩУ Д/Ж ДО 45 МНЕ СЕЙЧАС СКУЧНО 093 629 9...
4 2013-10-26 23:11:00    Зая я тебя никогда не обижу  люблю тебя!)  Даше

In [5]:
date.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 1 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    5 non-null      datetime64[ns]
dtypes: datetime64[ns](1)
memory usage: 168.0 bytes

In [6]:
time.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    1000 non-null   datetime64[ns]
 1   msg     1000 non-null   object
dtypes: datetime64[ns](1), object(1)
memory usage: 15.8+ KB

# Working with Dates

In [7]:
# Converting to datetime datatype
date['date'] = pd.to_datetime(date['date'])
date.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 1 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    5 non-null      datetime64[ns]
dtypes: datetime64[ns](1)
memory usage: 168.0 bytes

# 1. Extract year

In [8]:
date['date_year'] = date['date'].dt.year

date.sample(5)

        date  date_year
2 2018-10-23       2018
1 2018-08-15       2018
0 2019-12-10       2019
3 2019-08-17       2019
4 2019-01-06       2019

# 2. Extract Month

In [9]:
date['date_month_no'] = date['date'].dt.month

date.head()

        date  date_year  date_month_no
0 2019-12-10       2019             12
1 2018-08-15       2018              8
2 2018-10-23       2018             10
3 2019-08-17       2019              8
4 2019-01-06       2019              1

In [10]:
date['date_month_name'] = date['date'].dt.month_name()

date.head()

        date  date_year  date_month_no date_month_name
0 2019-12-10       2019             12        December
1 2018-08-15       2018              8          August
2 2018-10-23       2018             10         October
3 2019-08-17       2019              8          August
4 2019-01-06       2019              1         January

# Extract Days

In [11]:
date['date_day'] = date['date'].dt.day

date.head()

        date  date_year  date_month_no date_month_name  date_day
0 2019-12-10       2019             12        December        10
1 2018-08-15       2018              8          August        15
2 2018-10-23       2018             10         October        23
3 2019-08-17       2019              8          August        17
4 2019-01-06       2019              1         January         6

In [12]:
# day of week
date['date_dow'] = date['date'].dt.dayofweek

date.head()

        date  date_year  date_month_no date_month_name  date_day  date_dow
0 2019-12-10       2019             12        December        10         1
1 2018-08-15       2018              8          August        15         2
2 2018-10-23       2018             10         October        23         1
3 2019-08-17       2019              8          August        17         5
4 2019-01-06       2019              1         January         6         6

In [33]:
# day of week - name

date['date_dow_name'] = date['date'].dt.day_name()
date.head()

,date,date_year,date_month_no,date_month_name,date_day,date_dow,date_dow_name,date_is_weekend,date_week,quarter,semester
0,2019-12-10,2019,12,December,10,1,Tuesday,0,50,4,2
1,2018-08-15,2018,8,August,15,2,Wednesday,0,33,3,2
2,2018-10-23,2018,10,October,23,1,Tuesday,0,43,4,2
3,2019-08-17,2019,8,August,17,5,Saturday,1,33,3,2
4,2019-01-06,2019,1,January,6,6,Sunday,1,1,1,1

In [32]:
# is weekend?

date['date_is_weekend'] = np.where(date['date_dow_name'].isin(['Sunday', 'Saturday']), 1,0)
date.head()

,date,date_year,date_month_no,date_month_name,date_day,date_dow,date_dow_name,date_is_weekend,date_week,quarter,semester
0,2019-12-10,2019,12,December,10,1,Tuesday,0,50,4,2
1,2018-08-15,2018,8,August,15,2,Wednesday,0,33,3,2
2,2018-10-23,2018,10,October,23,1,Tuesday,0,43,4,2
3,2019-08-17,2019,8,August,17,5,Saturday,1,33,3,2
4,2019-01-06,2019,1,January,6,6,Sunday,1,1,1,1

# Extract week of the year

In [35]:
date['date_week'] = date['date'].dt.week

date.head()

C:\Users\vatsal shingala\AppData\Local\Temp\ipykernel_14096\402071721.py:1: FutureWarning: Series.dt.weekofyear and Series.dt.week have been deprecated. Please use Series.dt.isocalendar().week instead.
  date['date_week'] = date['date'].dt.week

,date,date_year,date_month_no,date_month_name,date_day,date_dow,date_dow_name,date_is_weekend,date_week,quarter,semester
0,2019-12-10,2019,12,December,10,1,Tuesday,0,50,4,2
1,2018-08-15,2018,8,August,15,2,Wednesday,0,33,3,2
2,2018-10-23,2018,10,October,23,1,Tuesday,0,43,4,2
3,2019-08-17,2019,8,August,17,5,Saturday,1,33,3,2
4,2019-01-06,2019,1,January,6,6,Sunday,1,1,1,1

# Extract Quarter

In [36]:
date['quarter'] = date['date'].dt.quarter

date.head()

,date,date_year,date_month_no,date_month_name,date_day,date_dow,date_dow_name,date_is_weekend,date_week,quarter,semester
0,2019-12-10,2019,12,December,10,1,Tuesday,0,50,4,2
1,2018-08-15,2018,8,August,15,2,Wednesday,0,33,3,2
2,2018-10-23,2018,10,October,23,1,Tuesday,0,43,4,2
3,2019-08-17,2019,8,August,17,5,Saturday,1,33,3,2
4,2019-01-06,2019,1,January,6,6,Sunday,1,1,1,1

# Extract Semester

In [17]:
date['semester'] = np.where(date['quarter'].isin([1,2]), 1, 2)

date.head()

# Extract Time elapsed between dates

In [40]:
time.head()

,date,msg,hour,min,sec,time
0,2013-12-15 00:50:00,ищу на сегодня мужика 37,0,50,0,00:50:00
1,2014-04-29 23:40:00,ПАРЕНЬ БИ ИЩЕТ ДРУГА СЕЙЧАС!! СМС ММС 0955532826,23,40,0,23:40:00
2,2012-12-30 00:21:00,Днепр.м 43 позн.с д/ж *.о 067.16.34.576,0,21,0,00:21:00
3,2014-11-28 00:31:00,КИЕВ ИЩУ Д/Ж ДО 45 МНЕ СЕЙЧАС СКУЧНО 093 629 9...,0,31,0,00:31:00
4,2013-10-26 23:11:00,Зая я тебя никогда не обижу люблю тебя!) Даше,23,11,0,23:11:00

In [38]:
import datetime

today = datetime.datetime.today()

today

datetime.datetime(2023, 6, 9, 1, 4, 51, 155608)

In [39]:
today - date['date']

0   1277 days 01:04:51.155608
1   1759 days 01:04:51.155608
2   1690 days 01:04:51.155608
3   1392 days 01:04:51.155608
4   1615 days 01:04:51.155608
Name: date, dtype: timedelta64[ns]

In [20]:
(today - date['date']).dt.days

0    1277
1    1759
2    1690
3    1392
4    1615
Name: date, dtype: int64

In [21]:
# Months passed

np.round((today -date['date']) / np.timedelta64(1, 'M'),0)

0    42.0
1    58.0
2    56.0
3    46.0
4    53.0
Name: date, dtype: float64

In [22]:
time.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    1000 non-null   datetime64[ns]
 1   msg     1000 non-null   object
dtypes: datetime64[ns](1), object(1)
memory usage: 15.8+ KB

In [23]:
# Converting to datetime datatype
time['date'] = pd.to_datetime(time['date'])
time.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    1000 non-null   datetime64[ns]
 1   msg     1000 non-null   object
dtypes: datetime64[ns](1), object(1)
memory usage: 15.8+ KB

In [24]:
time['hour'] = time['date'].dt.hour
time['min'] = time['date'].dt.minute
time['sec'] = time['date'].dt.second

time.head()

,date,msg,hour,min,sec
0,2013-12-15 00:50:00,ищу на сегодня мужика 37,0,50,0
1,2014-04-29 23:40:00,ПАРЕНЬ БИ ИЩЕТ ДРУГА СЕЙЧАС!! СМС ММС 0955532826,23,40,0
2,2012-12-30 00:21:00,Днепр.м 43 позн.с д/ж *.о 067.16.34.576,0,21,0
3,2014-11-28 00:31:00,КИЕВ ИЩУ Д/Ж ДО 45 МНЕ СЕЙЧАС СКУЧНО 093 629 9...,0,31,0
4,2013-10-26 23:11:00,Зая я тебя никогда не обижу люблю тебя!) Даше,23,11,0

# Extract Time part

In [25]:
time['time'] = time['date'].dt.time

time.head()

,date,msg,hour,min,sec,time
0,2013-12-15 00:50:00,ищу на сегодня мужика 37,0,50,0,00:50:00
1,2014-04-29 23:40:00,ПАРЕНЬ БИ ИЩЕТ ДРУГА СЕЙЧАС!! СМС ММС 0955532826,23,40,0,23:40:00
2,2012-12-30 00:21:00,Днепр.м 43 позн.с д/ж *.о 067.16.34.576,0,21,0,00:21:00
3,2014-11-28 00:31:00,КИЕВ ИЩУ Д/Ж ДО 45 МНЕ СЕЙЧАС СКУЧНО 093 629 9...,0,31,0,00:31:00
4,2013-10-26 23:11:00,Зая я тебя никогда не обижу люблю тебя!) Даше,23,11,0,23:11:00

# Time difference

In [26]:
today - time['date']

0     3463 days 00:08:04.321454
1     3327 days 01:18:04.321454
2     3813 days 00:37:04.321454
3     3115 days 00:27:04.321454
4     3512 days 01:47:04.321454
                 ...
995   4102 days 00:08:04.321454
996   3423 days 01:44:04.321454
997   3888 days 01:21:04.321454
998   4004 days 01:24:04.321454
999   3276 days 01:33:04.321454
Name: date, Length: 1000, dtype: timedelta64[ns]

In [27]:
# in seconds

(today - time['date'])/np.timedelta64(1,'s')

0      2.992037e+08
1      2.874575e+08
2      3.294454e+08
3      2.691376e+08
4      3.034432e+08
           ...
995    3.544133e+08
996    2.957534e+08
997    3.359281e+08
998    3.459506e+08
999    2.830520e+08
Name: date, Length: 1000, dtype: float64

In [28]:
# in minutes

(today - time['date'])/np.timedelta64(1,'m')

0      4.986728e+06
1      4.790958e+06
2      5.490757e+06
3      4.485627e+06
4      5.057387e+06
           ...
995    5.906888e+06
996    4.929224e+06
997    5.598801e+06
998    5.765844e+06
999    4.717533e+06
Name: date, Length: 1000, dtype: float64

In [29]:
# in hours

(today - time['date'])/np.timedelta64(1,'h')

0      83112.134534
1      79849.301200
2      91512.617867
3      74760.451200
4      84289.784534
           ...
995    98448.134534
996    82153.734534
997    93313.351200
998    96097.401200
999    78625.551200
Name: date, Length: 1000, dtype: float64